RedditClone/app/controllers/comments_controller.rb

  def create
    @comment = Comment.new(comment_params)
    @comment.post_id = params[:post_id]
    @comment.user_id = current_user.id
    @comment.parent_comment_id = params[:parent_comment_id]

    if @comment.save
---
INSERT INTO "comments" ("content", "user_id", "post_id", "created_at", "updated_at", "parent_comment_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["content", "this is my response"], ["user_id", 2], ["post_id", 2], ["created_at", "2018-11-21 00:52:11.053498"], ["updated_at", "2018-11-21 00:52:11.053498"], ["parent_comment_id", 3]]