RedditClone/app/controllers/posts_controller.rb

  def create
    @post = Post.create(post_params)
    @post.user_id = current_user.id
    @post.sub_id = params[:post][:sub_id]
    if @post.save
---
INSERT INTO "post_subs" ("post_id", "sub_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["post_id", 3], ["sub_id", 2], ["created_at", "2018-11-20 22:42:48.036508"], ["updated_at", "2018-11-20 22:42:48.036508"]]