RedditClone/app/controllers/posts_controller.rb

  def new
    @subs = Sub.all
---
SELECT "subs".* FROM "subs"

  def create
    @post = Post.create(post_params)
    @post.user_id = current_user.id
    if @post.save
---
INSERT INTO "posts" ("title", "url", "content", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "hello kitty"], ["url", "sario.com"], ["content", "kero kero piiiii"], ["user_id", 2], ["created_at", "2018-11-20 22:42:47.965285"], ["updated_at", "2018-11-20 22:42:47.965285"]]

  def edit
    @subs = Sub.all
    @post = Post.find_by(id: params[:id])
---
SELECT "subs".* FROM "subs"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]